Case2/0/chi.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      chi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../input.txt"

dimensions      [0 0 0 0 0 0 0];

internalField   uniform $initialChi;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }

    side
    {
        type            zeroGradient;
    }


    topmid
    {
        type            fixedValue;
        value           uniform $inletChi;
    }

    bottom
    {
        type            binaryReaction;
        value uniform 0;
        S uniform 0;
        RobinD   uniform $diffusivity;
        RobinK   uniform #calc "$reactionConstant*$thickness";
        RobinF   uniform 0;
        Kd uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
