Case2/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Whether to convert internal faces only (so leave boundary faces intact).
// This is only relevant if your face selection type can pick up boundary
// faces.
internalFacesOnly true;

fields true;

// Baffles to create.
baffles
{
    cyclicFaces
    {
        //- Select faces and orientation through a searchableSurface
        type        searchableSurface;
        surface     searchablePlate;
        origin      (-1 0.05 0);
        span        (3 0  1);

        patches
        {
            master
            {
                //- Master side patch

                name            porous_half0;
                type            cyclic;
                neighbourPatch  porous_half1;

                //- Optional override of added patchfields. If not specified
                //  any added patchfields are of type calculated.
                patchFields
                {
                    p
                    {
                        type            porousBafflePressure;
                        patchType       cyclic;
                        D               1e2;
                        I               0;
                        length          1;
                        jump            uniform 0;
                        value           uniform 0;
                    }
                }
            }
            slave
            {
                //- Slave side patch

                name            porous_half1;
                type            cyclic;
                neighbourPatch  porous_half0;

                patchFields
                {
                    ${...master.patchFields}
                }
            }
        }
    }
}


// ************************************************************************* //
